Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: In the following, we present three classes of applications that are commonly implemented using stateful stream processing: (1) event-driven applications, (2) data pipeline applications, and (3) data analytics applications.
zh_cn: 接下来我们介绍三类常见的状态化流处理应用：1）事件驱动型应用；2）数据管道应用；3）数据分析应用。

source: In the following, we show the different built-in window assigners of the DataStream API and how to use them to define window operators.
zh_cn: 接下来我们将介绍DataStream API中的多种内置窗口分配器以及如何用它们来定义窗口算子。

source: In the following, we will guide you through the process of starting a local cluster and executing a streaming application to give you a first look at Flink.
zh_cn: 为了让你对Flink有一个初步印象，接下来我们将一步步指导你启动本地集群并运行一个流式应用。

source: In the following, we will use a keyBy transformation to convert a DataStream into a KeyedStream and keyed transformations such as rolling aggrega‐
zh_cn: 下面我们将使用keyBy转换将一个DataStream转化为KeyedStream，然后对它进行滚动聚合以及reduce操作。

source: In the introductory example of this chapter, we defined the following case class:
zh_cn: 在本章的开篇示例中，我们定义了如下样例类：

source: In the library mode, there is no Flink ser‐ vice continuously running.
zh_cn: 而在库模式中，Flink服务不是一直运行，

source: In the library style, there is no Flink service.
zh_cn: 而在库模式中，Flink不是作为服务，

source: In the mobile gaming case for example, it is practically impossible to know for how long a user might remain disconnected; they could be going through a tunnel, boarding a plane, or never playing again.
zh_cn: 以手游场景为例，现实中根本无法得知用户离线多久，他们可能正在过隧道，可能正在上飞机，也可能直接退坑不玩了。

source: In the mobile gaming example, it is practically impossi‐ ble to know how long a user might remain disconnected; they could be going through a tunnel, boarding a plane, or never playing again.
zh_cn: 以手游场景为例，现实中根本无法得知用户会离线多久。他们可能正在过隧道，可能正在上飞机，也可能直接退坑不玩了。

source: In the next section, we discuss task failures and result guarantees in detail.
zh_cn: 在下一节，我们会讨论有关任务故障和结果保障的详情。

source: In the next section, you will learn about task failures and result guarantees in detail.
zh_cn: 在下一节，你将了解任务故障和结果保障的详细信息。

source: In the past, analyzing data with a few hours or even days delay was often
zh_cn: 在过去，由于对最新结果或见解的快速反应并不会产生显著优势，因此人们完全可以接受分析数据存在几小时甚至几天的延迟。

source: In the preceding code, elements are allowed to be late up to 10 seconds.
zh_cn: 以上代码中，元素最多允许延迟10秒。

source: In the preceding example, you instruct the program to emit watermarks every 5 sec‐ onds.
zh_cn: 在上方示例中，我们指示程序每隔5秒发出一次水位线。

source: In the previous chapter, you saw how streaming applications have different opera‐ tional requirements from traditional batch programs.
zh_cn: 在上一章，你已经了解了流式应用在操作需求方面和传统批处理程序有所不同，

source: In the remainder of the chapter we focus on keyed windows only.
zh_cn: 在本章剩余部分，我们将只关注键值分区窗口。

source: In the rest of this book, we are going to see how Flink actually implements these concepts and how you can use its DataStream API to write applications that use all of the features we have introduced so far.
zh_cn: 在本书的剩余部分，我们会介绍Flink是如何实现这些概念的，以及怎样利用它的DataStream API来编写一些涵盖了目前为止所讲特性的应用。

source: In the rest of this book, we are going to see how Flink actually implements these concepts and how you can use its DataStream APIs to write applications that use all of the features that we have introduced so far.
zh_cn: 在本书的其余部分，我们会介绍Flink是如何实现这些概念的，以及怎样利用它的DataStream API来编写那些涵盖目前所介绍的所有特性的应用。

source: In the rest of this chapter, we are going to look deeper into the concepts of time and state guarantees under failures in data stream processing.
zh_cn: 在本章剩余部分，我们将深入研究流处理发生故障时的时间和状态保障相关概念。

source: In the rest of this chapter, we are going to look deeper into the concepts of time and state guarantees under failures in data stream process‐ ing.
zh_cn: 在本章剩余部分，我们将深入研究流处理中的时间以及在发生故障时和状态保障相关概念。

source: In the rest of this chapter, when we talk about “result guarantees” we mean the consistency of the internal state of the stream processor.
zh_cn: 在本章剩余部分，当提到"结果保障"，我们指的是流处理引擎内部状态的一致性。

source: In the rest of this chapter, when we talk about “result guarantees” we refer to the consistency of the internal state of the stream processor.
zh_cn: 在本章剩余部分，当提到"结果保障"，我们指的是流处理引擎内部状态的一致性。

source: In the streaming world, however, dealing with failures is not a trivial problem.
zh_cn: 然而在流式场景中，处理故障就没那么容易了。

source: In the streaming world, however, dealing with fail‐ ures is not a trivial problem.
zh_cn: 然而在流式场景中，处理故障就没那么容易了。

source: In the very simple case, there will be at least one source and one sink apart from the stream processor.
zh_cn: 即便是最简单的情形，除了流处理引擎也至少要有一个数据源和一个数据汇。

source: In the worst case, you will locate the event more than once.
zh_cn: 它最坏的情况也无非就是多几次定位到目标事件。

source: In this architecture the event log acts as a source of
zh_cn: 在该架构下，事件日志扮演了真实数据源的角色，

source: In this architecture the event log persists the input events and can replay them in deterministic order.
zh_cn: 在该架构下，事件日志系统可以持久化输入事件并以确定的顺序将其重放。

source: In this case you can configure the maximum number of concurrent check‐ points.
zh_cn: 在该情况下，你可以为生成检查点配置最大并发数。

source: In this case, Flink does not start the application to avoid losing the
zh_cn: 那么Flink将不会启动应用，以防保存点中的状态丢失。

source: In this case, any custom states of the triggers also need to be merged.
zh_cn: 在该情况下所有触发器的自定义状态同样需要合并。

source: In this case, late events might arrive after the watermark, and we should provide some code to handle them.
zh_cn: 该情况下，延迟事件可能会在水位线之后到来，我们必须额外加一些代码来处理它们。

source: In this case, late events might arrive after the watermark and we should provide some code to handle them.
zh_cn: 该情况下，延迟事件可能会在水位线之后到来，我们必须额外加一些代码来处理它们。

source: In this case, latency-tracking estimation will not be reliable, as its current implementation assumes synchronized clocks.
zh_cn: 在该情况下，延迟追踪的估计值将变得不可靠，因为目前的实现是以时钟同步为前提。

source: In this case, some stateful operators run special logic to initialize their state.
zh_cn: 在该情况下，部分状态化算子会运行一些特殊逻辑来对状态进行初始化。

source: In this case, the dependencies are loaded into the classpath when Flink processes are started.
zh_cn: 这样在Flink进程启动时就会将依赖加载到Classpath中。

source: In this case, the new state is initialized as empty.
zh_cn: 那么在该情况下，新的状态会被初始化为空。

source: In this case, the positions are provided as a list, one after the other.
zh_cn: 只需将所有位置以列表的形式逐一提供即可。

source: In this case, you can ach‐ ieve exactly-once semantics with at-least-once guarantees.
zh_cn: 该情况下，你可以利用至少一次保障去实现精确一次的语义。

source: In this case, you can achieve exactly-once semantics with at-least-once guar‐ antees.
zh_cn: 该情况下，你可以用至少一次保障来实现精确一次的语义。

source: In this case, you should provide more memory to the network stack.
zh_cn: 在该情况下，你就需要给网络栈分配更多内存。

source: In this chapter we discuss why stateful stream processing is becoming so popular and assess its potential.
zh_cn: 本章我们将讨论为何状态化流处理会变得流行，并进一步评估它的发展潜力。

source: In this chapter we discussed Flink’s high-level architecture and the internals of its net‐ working stack, event-time processing mode, state management, and failure recovery mechanism.
zh_cn: 本章我们主要讨论了Flink的高层次设计架构以及内部的网络栈、事件时间处理模式、状态管理以及故障恢复机制。

source: In this chapter we discussed how Flink is set up in different environments and how to configure HA setups.
zh_cn: 本章我们首先讨论了如何针对不同环境搭建Flink集群以及如何进行HA设置。

source: In this chapter we give a high-level introduc‐ tion to Flink’s architecture and describe how Flink addresses the aspects of stream processing that we discussed before.
zh_cn: 本章中我们将从一个较高的层次来讲解Flink的架构，并介绍Flink是如何解决之前讨论的流处理相关问题。

source: In this chapter we introduced the basics of Flink’s DataStream API.
zh_cn: 本章我们介绍了Flink DataStream API的基础知识。

source: In this chapter you learned how Flink DataStream applications can read data from and write data to external systems and the requirements for an application to achieve different end-to-end consistency guarantees.
zh_cn: 本章你学到了Flink DataStream应用如何读写外部系统的数据，以及应用实现不同端到端一致性保障的相关需求。

source: In this chapter you learned how to implement streaming applications that operate on time.
zh_cn: 在本章中，你学到了如何实现对时间进行操作的流式应用。

source: In this chapter you learned how to set up an environment to develop and debug Flink DataStream applications and how to generate a Maven project using Flink’s Maven archetype.
zh_cn: 本章你学到了如何搭建一个用于开发和调试Flink DataStream应用的环境，以及如何使用Flink的Maven模板生成Maven项目。

source: In this chapter, we discuss how source and sink connectors affect the consistency guarantees of Flink streaming applications and present Flink’s most popular connec‐ tors to read and write data.
zh_cn: 在本章中，我们将讨论数据源和数据汇连接器如何影响Flink流式应用的一致性保障，并介绍Flink中最常用的数据读写连接器。

source: In this chapter, we discuss the different ways to deploy Flink clusters and how to con‐ figure them securely and make them highly available.
zh_cn: 本章我们将讨论Flink集群的多种部署方式以及如何对它进行安全和高可用配置。

source: In this chapter, we discuss why stateful stream processing is becoming so popular and assess its poten‐ tial.
zh_cn: 本章我们会讨论为何状态化流处理会变得如此流行，并进一步评估其发展潜力。

source: In this chapter, we discussed how to run, manage, and monitor Flink applications in production.
zh_cn: 本章我们讨论了如何在生产环境中运行、管理和监控Flink应用。

source: In this chapter, we give a high-level introduction to Flink’s architecture and describe how Flink addresses the aspects of stream processing we discussed earlier.
zh_cn: 本章我们将从一个较高的层次来讲解Flink的架构，并介绍它如何解决我们之前讨论的流处理相关问题。

source: In this chapter, we introduced stateful stream processing, discussed its use cases, and had a first look at Apache Flink.
zh_cn: 本章我们介绍了状态化流处理，讨论了它的几个用例并对Apache Flink进行了初步介绍。

source: In this chapter, we present the tools Flink offers for operating and maintaining continuously running streaming applications.
zh_cn: 本章我们将介绍Flink所提供的用于持续运行流式应用的运维工具。

source: In this chapter, we will cover DataStream API methods for time handling and time- based operators, like windows.
zh_cn: 本章我们将介绍DataStream API中用于处理时间的方法和基于时间的算子（如窗口）。

source: In this chapter, you have learned the fundamental concepts and ideas of data stream processing.
zh_cn: 本章中你主要学习了数据流处理的基本概念和思想。

source: In this chapter, you learned the fundamentals of data stream processing.
zh_cn: 本章主要教给你数据流处理相关的基础知识。

source: In this chapter, you will enter the streaming world for good and you will get the necessary background for the rest of this book.
zh_cn: 在本章中，你将踏入流处理的世界并从中获得本书其余部分所需的背景知识。

source: In this chapter, you will enter the streaming world for good.
zh_cn: 本章将正式引领你踏入流处理的世界。

source: In this chapter, you will learn how to set up an environment to develop, run, and debug Flink applications.
zh_cn: 本章你将学到如何搭建一个用于开发、运行和调试Flink应用的环境。

source: In this example the tuple input stream is keyed by the first field and the rolling sum is computed on the second field.
zh_cn: 该示例中，输入流的元组按照第一个字段进行分区，然后滚动计算第二个字段的总和。

source: In this example, a DataStream[(String,
zh_cn: 该示例会将DataStream[(String, Float)]写入"sensors"表中。

source: In this example, after reading the stream, we first apply a filter transformation and then call the
zh_cn: 在这个例子中，我们首先使用了一个过滤转换，

source: In this example, the JobID is bc0b2ad61ecd4a615d92ce25390f61ad.
zh_cn: 上述例子中，JobID是bc0b2ad61ecd4a615d92ce25390f61ad。

source: In this mode, Flink applications are packaged into a JAR file and submitted by a client to a running service.
zh_cn: 在该模式下，Flink应用会打包成一个JAR文件，通过客户端提交到运行的服务上。

source: In this mode, the Flink application is bundled in an application-specific con‐ tainer image, such as a Docker image.
zh_cn: 在该模式下，Flink应用会绑定到一个特定应用的容器镜像（如Docker镜像）中。

source: In this scenario, a stateful function receives records with keys that are only active for a cer‐ tain period of time and are never received after that.
zh_cn: 在该场景下，状态化函数所接收记录的键值只有一段特定时间的活跃期，此后就再也不会收到。

source: In this scenario, you want to know if there has been an accident in a certain location within the last few minutes.
zh_cn: 在该场景下，你想知道在最近几分钟内某个特定位置有没有发生交通事故。

source: In this section we describe the different components that a Flink setup consists of and discuss their responsibilities and how they interact with each other to execute an
zh_cn: 在本节，我们将首先介绍Flink设置中的不同组件，讨论它们的职责以及在运行应用时如何交互。

source: In this section we give an overview of the basic transformations of the DataStream API.
zh_cn: 本节我们将对DataStream API中的基本转换做一个概述。

source: In this section, we describe both operators.
zh_cn: 本节我们会对它们进行介绍。

source: In this section, we describe how Flink initializes the state of an application started from a savepoint.
zh_cn: 本节我们将介绍Flink在从保存点启动时如何去初始化应用状态。

source: In this section, we describe how to build a job-specific Docker image and how to deploy a library-style bundled application on Kubernetes.
zh_cn: 在本节中，我们将介绍如何针对特定作业构建Docker镜像，以及如何在Kubernetes上以库模式部署绑定的应用。

source: In this section, we describe the different components of a Flink setup and how they interact with each other to execute an application.
zh_cn: 本节我们将介绍搭建Flink时所涉及的不同组件并讨论它们在应用运行时的交互过程。

source: In this section, we describe the most common streaming operations.
zh_cn: 在本节中，我们来介绍最常见的流式操作，

source: In this section, we describe the parameters used to control checkpointing and recovery of applications.
zh_cn: 本节我们将介绍一些用于控制生成检查点和应用恢复的参数。

source: In this section, we describe the semantics of common window types.
zh_cn: 本节我们会介绍常见窗口类型的语义。

source: In this section, we discuss aspects that need to be taken into account to ensure robust execution behavior and consistent performance of long- running applications.
zh_cn: 本节我们将重点讨论几个方面，它们可以为长期运行应用的健壮执行和一致性能提供保障。

source: In this section, we discuss both types and how they manage and process data.
zh_cn: 在本节中，我们将讨论这两类处理模型以及它们如何管理和处理数据。

source: In this section, we discuss different aspects that typically need to be config‐ ured when setting up a Flink cluster.
zh_cn: 本节我们将讨论搭建Flink集群时针对不同方面的典型配置。

source: In this section, we discuss how operators process watermarks.
zh_cn: 本节我们主要讨论算子对水位线的处理方式。

source: In this section, we discuss the different types of functions that can be applied on a window to perform aggregations or arbitrary computations on the window’s con‐ tents.
zh_cn: 本节我们将讨论一些可用在窗口上的不同函数，它们支持对窗口内容执行聚合或任意计算。

source: In this section, we discuss the different types of states Flink supports.
zh_cn: 本节我们会对Flink支持的不同类别的状态进行介绍。

source: In this section, we discuss the lifecycle of
zh_cn: 本节我们将讨论窗口的生命周期，

source: In this section, we discuss the types supported by Flink, how to create type informa‐ tion for a data type, and how to help Flink’s type system with hints if it cannot auto‐ matically infer the return type of a function.
zh_cn: 本节我们会讨论Flink支持的类型，如何为数据类型创建类型信息，以及当Flink无法自动推断函数的返回类型时如何以提示的方式帮助类型系统。

source: In this section, we discuss window operations, which provide such a mech‐ anism.
zh_cn: 在本章中，我们以窗口操作为例讨论这个机制。

source: In this section, we discuss window operations, which pro‐ vide this service.
zh_cn: 在本节中，我们将讨论提供了此项功能的窗口操作。

source: In this section, we explain how to configure and start Flink in different environments—including standalone clusters, Docker, Apache Hadoop YARN, and Kubernetes—and how Flink’s compo‐ nents are assembled in each setup.
zh_cn: 本节我们将向你介绍如何在不同环境下（独立集群，Docker，Apache Hadoop YARN以及Kubernetes）配置并启动Flink，以及在每种部署模式下它的组件是如何组装到一起的。

source: In this section, we explain the different ways in which you can define and para‐ metrize functions in the DataStream API in more detail.
zh_cn: 本节我们会对在DataStream API中定义和参数化函数的各种方式进行一个更加详细的解释。

source: In this section, we explain the practical aspects of savepoints and discuss how to start, stop, pause and resume, scale, and upgrade stateful streaming applications using Flink’s command-line client and Flink’s REST API.
zh_cn: 本节我们将解释保存点的实际应用场景，并讨论如何使用Flink命令行客户端和REST API来完成对于状态化流式应用的启动、停止、暂停、恢复、扩缩容和升级。

source: In this section, we introduce time semantics and describe the different notions of time in streaming.
zh_cn: 本节我们将介绍流式场景中时间语义和不同的时间概念。

source: In this section, we present Flink’s checkpointing and recovery mechanism to guaran‐ tee exactly-once state consistency.
zh_cn: 本节我们将介绍Flink的检查点（checkpoint）及故障恢复机制，看一下它们如何提供精确一次的状态一致性保障。

source: In this section, we show how functions with keyed and operator state are implemented.
zh_cn: 本节我们将展示如何实现带有键值分区状态及算子状态的函数。

source: In this section, we show you how to define window operators, present the built- in window types of the DataStream API, discuss the functions that can be applied on a window, and finally explain how to define custom windowing logic.
zh_cn: 本节我们将向你展示如何定义窗口算子，介绍DataStream API的内置窗口类型，讨论可用于窗口的函数并说明如何自定义窗口逻辑。

source: In this section, we will configure this mode for different deployment options.
zh_cn: 本节我们将介绍如何针对不同部署选择来配置该模式。

source: In this section, we will see how to use watermarks to configure event-time window behavior.
zh_cn: 在本节中，我们将了解如何利用水位线来设定事件时间窗口的行为。

source: In this section, we will see how we can use the concept of watermarks to configure event-time window behavior.
zh_cn: 在本节中，我们来看一下如何利用水位线概念来设定事件窗口的行为。

source: In this section, you are going to learn how to process infinite streams in parallel, using the dataflow programming paradigm.
zh_cn: 本节你将学到如何利用Dataflow编程范式并行处理无限数据流。

source: In this section, you are going to learn the concepts of processing infinite streams in parallel, using the dataflow programming paradigm.
zh_cn: 本节中你将学到用dataflow编程范式去并行处理无限数据流的相关概念。

source: In this section, you will learn how Flink restarts failed processes.
zh_cn: 本节你将学到Flink如何重启故障进程。

source: In this situation, the JobManager will ask the ResourceManager to provide
zh_cn: 这时候JobManager就会向ResourceManager申请更多的处理槽，

source: In this situation, the JobManager will ask the ResourceManager to provide more processing slots.
zh_cn: 这时候JobManager就会向ResourceManager申请更多的处理槽。

source: In version 1.7, Flink provides a few classes that extend FileInputFormat and imple‐ ment CheckpointableInputFormat.
zh_cn: 在1.7版本中，Flink提供了一些继承自FileInputFormat并实现了CheckpointableInputFormat的类。

source: In “Application Deploy‐ ment” on page 39, we briefly explained an alternative—the library mode that does not require a running Flink cluster to submit a job.
zh_cn: 在第39页"应用部署"一节，我们还简要介绍了另一种部署形式——库模式，它无需一个已运行的Flink集群来接收提交作业。

source: In “Checkpointing and State Backends” on page 243, we discussed the configuration options for state backends.
zh_cn: 在第243页"检查点和状态后端"一节，我们讨论了不同状态后端的配置选项。

source: In “Checkpoints, Savepoints, and State Recovery”, we explained Flink’s mechanism to create consistent checkpoints of a stateful application, a snapshot of the state of all built-in and user-defined stateful functions at a point in time when all operators pro‐ cessed all events up to a specific position in the application’s input streams.
zh_cn: 在"检查点、保存点即状态恢复"一节，我们解释了Flink为状态化应用创建一致性检查点的机制——在所有算子都处理到应用输入流的某一特定位置时，为全部内置或用户定义的状态化函数基于该时间点创建一个状态快照。

source: In “Checkpoints, Savepoints, and State Recovery”, you learned that Flink’s check‐ pointing and recovery mechanism periodically takes consistent checkpoints of an application’s state.
zh_cn: 在"检查点、保存点及状态恢复"一节，你了解到Flink的检查点和恢复机制会周期性地为应用状态创建一致性检查点。

source: In “Components of a Flink Setup”, we introduced the different components of a Flink setup: the JobMan‐ ager, TaskManager, ResourceManager, and Dispatcher.
zh_cn: 在"搭建Flink所需组件"一节，我们介绍了Flink搭建过程中所涉及的不同组件：JobManager、TaskManager、ResourceManager及Dispatcher。

source: In “Controlling Task Chaining” on page 261, we show how to disable task chaining for an application and how to control the chaining behavior of individual operators.
zh_cn: 在第261页的"控制任务链接"一节，我们会展示如何针对某一应用禁用任务链接以及如何单独控制单个算子的链接行为。

source: In “Controlling Task Scheduling” on page 260 we discuss how to con‐ trol the scheduling of tasks.
zh_cn: 我们将在260页"控制任务调度"一节讨论如何控制任务调度。

source: In “Deployment Modes” on page 221, we will dis‐ cuss how to set up and configure Flink for different environments.
zh_cn: 在第221页"部署模式"一节，我们会讨论如何针对不同环境搭建及配置Flink。

source: In “Emitting to Side Outputs” on page 119, we present the side-output feature of the process functions, which can emit multiple streams of different types from a function.
zh_cn: 在119页"向副输出（side output）发送数据"一节，我们会介绍针对处理函数的副输出功能，它可以从函数中发出多条类型不同的数据流。

source: In “Latency” on page 20, we defined latency broadly as the time it takes to process an event.
zh_cn: 在第20页的"延迟"一节中，我们宽泛地将延迟定义为处理事件所需的时间。

source: In “Savepoints”, we explained that each state in a savepoint can be addressed by a composite identifier consisting of a unique operator identifier and the state name declared by the state descriptor.
zh_cn: 在"保存点"一节，我们说明了保存点中的每个状态都可以利用一个复合标识进行定位，该标识包含了一个唯一算子标识和一个由状态描述符声明的状态名称。

source: In “State Backends” on page 55, we explained that Flink maintains application state in a state backend.
zh_cn: 在第55页"状态后端"一节，我们介绍了Flink使用状态后端来维护应用状态。

source: In “State Management” on page 53, we discussed that Flink supports three types of operator state: list state, list union state, and broadcast state.
zh_cn: 在53页"状态管理"一节，我们讨论了Flink支持的三种算子状态：列表状态、联合列表状态以及广播状态。

source: In “State Management”, we explained that functions can have two types of state, keyed state and operator state.
zh_cn: 在"状态管理"一节，我们提到了函数的状态类型有两种——键值分区状态和算子状态。

source: In “Task Execution”, we described how Flink assigns tasks to slots and how it lever‐ ages task chaining to reduce the cost of local data exchange.
zh_cn: 在"任务执行"一节，我们介绍了Flink如何将任务分配到处理槽以及如何利用任务链接来降低本地数据交换成本。

source: In “Time Semantics” on page 27, we highlighted the importance of time semantics for stream processing applications and explained the differences between processing time and event time.
zh_cn: 在第27页的"时间语义"一节，我们强调了时间语义对于流处理应用的重要性并解释了处理时间和事件时间的差异。

source: Including External and Flink Dependencies
zh_cn: 导入外部和Flink依赖

source: Including External and Flink Dependencies | 107
zh_cn: 导入外部和Flink依赖 | 107

source: Increasing the checkpointing interval reduces the overhead of fault tolerance during regular pro‐ cessing.
zh_cn: 增大检查点的生成间隔可以降低常规处理过程中容错的开销。

source: Incremental aggregation and ProcessWindowFunction
zh_cn: 增量聚合与ProcessWindowFunction

source: Incremental aggregation functions are directly applied when an element is added to a window and hold and update a single value as window state.
zh_cn: 增量聚合函数。它的应用场景是窗口内以状态形式存储某个值且需要根据每个加入窗口的元素对该值进行更新。

source: Index.
zh_cn: 索引

source: Ingesting, transforming, and inserting data with low latency is another common use case for stateful stream processing applications.
zh_cn: 状态化流处理应用的另一个日常用例是以低延迟的方式获取、转换并插入数据，

source: InputFormat is Flink’s interface to define data sources in the DataSet API.
zh_cn: InputFormat是Flink在DataSet API中定义数据源的接口。

source: Inspect the web dashboard.
zh_cn: 检查一下Web UI，

source: Instead a common approach is to write all changes into an event log that serves as source of truth.
zh_cn: 一种常见的替代方法是把所有改动写入事件日志系统中，并以它为事实来源。

source: Instead it takes advantage of distributed file systems like HDFS or object stores such as S3.
zh_cn: 而是利用了现有的分布式文件系统（如：HDFS）或对象存储（如：S3）。

source: Instead of adding new states to an application, you might also want to adjust an appli‐ cation by removing state—either by removing a complete stateful operator or just a state from a function.
zh_cn: 除了向应用中添加状态，你可能还想在修改应用的同时从中删除一些状态。这些删除操作所针对的可以是一个完整的状态化算子，也可以是函数中的某个状态。

source: Instead of dropping or redirecting late events, another strategy is to recompute an incomplete result and emit an update.
zh_cn: 除了将迟到事件丢弃或重定向外，另一种策略是对不完整的结果进行重新计算并发出更新。

source: Instead of inserting all data into a relational database system, significant amounts of data, such as, log files, social media, or web click logs, are written into Hadoop’s distributed file system (HDFS) or other bulk data stores, like Apache HBase, which provide massive storage capacity at small cost.
zh_cn: 海量日志文件、社交媒体、网页点击日志等数据已不再使用关系数据库系统存储，而是会写入Hadoop分布式文件系统（HDFS）或其他诸如Apache HBase的批量数据存储系统。这些系统以低廉的成本提供庞大的存储容量，

source: Instead of inserting all data into a relational data‐ base system, significant amounts of data, such as log files, social media, or web click logs, are written into Hadoop’s distributed filesystem (HDFS), S3, or other bulk data‐ stores, like Apache HBase, which provide massive storage capacity at a small cost.
zh_cn: 海量日志文件、社交媒体、网页点击日志等数据已不再使用关系数据库系统存储，而是会写入Hadoop分布式文件系统（HDFS）、S3或其他诸如Apache HBase的批量数据存储系统。这些系统以低廉的成本提供庞大的存储容量，
